CSI API ETABS v1

# cDCompColEurocode_4_2004 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDCompColEurocode_4_2004

    Public Interface cDCompColEurocode_4_2004

    Dim instance As cDCompColEurocode_4_2004

    public interface class cDCompColEurocode_4_2004

    type cDCompColEurocode_4_2004 =  interface end

The cDCompColEurocode_4_2004 type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetOverwrite|  Retrieves the value
of a composite column design overwrite item
| [GetPreference](28b1a39d-4553-b2eb-
ba03-02bd27dbcaf4.htm)|  Retrieves the value of a composite column design
preference item.
|
SetOverwrite|  Sets the value of a
composite column design overwrite item
|
SetPreference|  Sets the value of
a composite column design preference item.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com